#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Wed Feb 14 22:52:55 2024

@author: bojin
"""
import numpy as np
import random

mats=['虾','排骨','三文鱼','鸡腿肉','牛肉',
      '青椒','多宝鱼','芹菜','金针菇','茭白',
      '猪肉','豆芽','西兰花','虾仁','萝卜',
      '杏鲍菇','西葫芦','海鲈鱼','芦笋','丝瓜',
      '青菜','花菜','娃娃菜','菠菜','油菜',
      '莴苣','胡萝卜','白菜','秋葵','鸡毛菜',
      '香菇','虫草花','半只鸡','鸡蛋','乳鸽',
      '黄芪','玉米','番茄','冬瓜','肉丸',
      '贝柱','竹荪','瑶柱','花胶','红枣',
      '核桃','山药','牛奶','燕窝','海参',
      '枸杞','红糖','红花生','百合','银耳',
      '杏仁','燕麦','面包','小米','馄饨',
      '桂圆','大米','南瓜','烧卖','紫米',
      '红豆','芝麻','饺子','鹌鹑蛋','豆沙包',
      '小笼包','花卷','虾饺','吐司片','鸭血',
      '馒头'
      ]


meat={'水煮虾':(0),'糖醋排骨':(1),'煎三文鱼':(2),'手撕鸡肉':(3),
      '青椒炒牛肉':(4,5),'清蒸多宝鱼':(6),'芹菜炒牛肉':(4,7),'红烧排骨':(1),
      '金针菇炒牛肉':(4,8),'茭白炒肉片':(10,9),'西芹炒肉':(10,7),'豆芽炒肉':(10,11),
      '虾仁炒西兰花':(13,12),'萝卜牛肉煲':(4,14),'杏鲍菇炒肉片':(10,15),'西芹炒虾仁':(0,7),
      '西葫芦炒肉':(10,16),'清蒸海鲈鱼':(17),'虾仁芦笋':(0,18),'丝瓜炒肉':(10,19)
      }
vege={'炒青菜':(20),'炒花菜':(21),'炒娃娃菜':(22),'炒菠菜':(23),
      '炒油菜':(24),'炒莴苣':(25),'胡萝卜炒西兰花':(26,12),'炒白菜':(27),
      '拌秋葵':(28),'炒鸡毛菜':(29),'炒西兰花':(12),'香菇炒青菜':(30,20),
      '炒丝瓜':(19),'番茄炒蛋':(33,37)
      }
soup={'虫草花鸡汤':(32,31),'丝瓜蛋汤':(33,19),'黄芪乳鸽汤':(34,35),'玉米胡萝卜排骨汤':(1,36,26),
      '番茄蛋花汤':(33,37),'鸭血菠菜汤':(74,23),'番茄牛肉汤':(4,37),'萝卜排骨汤':(1,14),
      '冬瓜肉丸子汤':(39,38),'竹荪贝柱冬瓜汤':(40,41,38),
      '玉米排骨汤':(36,1),'瑶柱丝瓜汤':(42,19),'胡萝卜牛肉汤':(26,4),'丸子蔬菜汤':(39,23),
      '竹荪贝柱汤':(40,41),'虫草花乳鸽汤':(34,31),'花胶炖鸡汤':(32,43),'红枣乌鸡汤':(32,44)
      }
rice={'贝柱虾仁粥':(40,13,61),'山药百合粥':(46,53,61),'小米枸杞粥':(50,58),'小米红枣粥':(44,58),
      '桂圆小米粥':(60,58),'胡萝卜小米粥':(26,58),'瑶柱菜心粥':(42,20,61),'红豆紫米粥':(65,64),
      '南瓜山药瘦肉粥':(62,46,10,61)
      }
dims={'核桃山药浆':(45,46),'牛奶燕窝':(47,48),'五红汤':(65,44,51,52,50),'海参鸡蛋羹':(49,33),
      '百合银耳羹':(53,54),'杏仁燕麦浆':(55,56),'面包':(57),'鸡蛋羹':(33),
      '馄饨':(59),'馒头':(75),'蒸南瓜':(62),'荷包蛋':(33),
      '烧卖':(63),'芝麻山药糊':(66,46),'牛奶':(47),'饺子':(67),
      '红枣核桃糊':(44,45),'鹌鹑蛋':(68),'豆沙包':(69),'小笼包':(70),
      '花卷':(71),'虾饺':(72),'山药红枣米糊':(46,44),'鸡蛋液煎吐司片':(33,73),
      }

# 第一个主材不一样
# 早餐：1粥、鸡蛋、牛奶；加餐：水果；午饭：1荤2素1汤；加餐：1点心；晚饭：2荤1素；加餐：1点心
def sample(m_dict,n, mats):
    mkey=list(m_dict.keys())
    mm=random.sample(range(len(m_dict)),n)
    dish=[]
    mat=[]
    for ind in mm:
        dish.append(mkey[ind])
        if type(m_dict[mkey[ind]]) is int:
            mat.append(m_dict[mkey[ind]])
        else:
            mat+=list(m_dict[mkey[ind]])
        #print('Dish: '+mkey[ind]+', '+str(m_dict[mkey[ind]]))
    mat=[mats[i] for i in list(set(mat))]
    return (dish, mat)

def menu_day():
    rr=sample(rice,1,mats)
    ss=sample(soup,1,mats)
    mm=sample(meat,3,mats)
    vv=sample(vege,3,mats)
    dd=sample(dims,2,mats)
    
    dish_all=rr[0]+ss[0]+mm[0]+vv[0]+dd[0]
    mat_all=list(set(rr[1]+ss[1]+mm[1]+vv[1]+dd[1]))
    
    return dish_all, mat_all

dish_all=()
mat_all=()
ss_all=()
for i in range(10):
    dish_d1, mat_d1 = menu_day()
    dish_d2, mat_d2 = menu_day()
    dish_all+=(list(set(dish_d1+dish_d2)),)
    mat_all+=(list(set(mat_d1+mat_d2)),)
    ss_all+=(len(list(set(mat_d1+mat_d2))),)
    
i=ss_all.index(min(ss_all))
print('-'*18)
print('菜单：')
print('-'*18)
[print(dish) for dish in dish_all[i]]
print('-'*18)
print('材料：')
print('-'*18)
[print(mat) for mat in mat_all[i]]







